In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [ ]:
#Display a Derived Value for Each Row
SELECT 
    customer_name, 
    (SELECT MAX(order_amount) FROM Orders) AS max_order_amount
FROM Customers;

In [ ]:
#Subquery in where 
1.
SELECT customer_name
FROM Customers
WHERE customer_id IN (
    SELECT DISTINCT customer_id
    FROM Orders
    WHERE order_amount > 5000
);

In [ ]:
#Instead of join 
SELECT customer_name
FROM Customers
WHERE EXISTS (
    select * from customers where city = 'chennai'
    SELECT 1
    FROM Orders
    WHERE Orders.customer_id = Customers.customer_id
    AND order_date >= CURDATE() - INTERVAL 30 DAY
);

In [ ]:

#Use a Subquery in the FROM Clause

SELECT 
    id,
    customer_name,
    name_length,
    uppercase_name,
    lowercase_name,
    contact_info,
    name_prefix,
    trimmed_city,
    left_padded_name,
    right_padded_name,
    updated_name,
    position_of_a,
    first_5_chars,
    last_5_chars,
    reversed_name,
    formatted_number
FROM (
    SELECT 
        id,
        customer_name,
        LENGTH(customer_name) AS name_length,
        UPPER(customer_name) AS uppercase_name,
        LOWER(customer_name) AS lowercase_name,
        CONCAT(city, ' - ', COALESCE(phone_number, '00000')) AS contact_info,
        SUBSTRING(customer_name, 1, 5) AS name_prefix,
        TRIM('   ExampleCity   ') AS trimmed_city,
        LPAD(customer_name, 15, '*') AS left_padded_name,
        RPAD(customer_name, 15, '-') AS right_padded_name,
        REPLACE(customer_name, ' ', '_') AS updated_name,
        INSTR(customer_name, 'a') AS position_of_a,
        LEFT(customer_name, 5) AS first_5_chars,
        RIGHT(customer_name, 5) AS last_5_chars,
        REVERSE(customer_name) AS reversed_name,
        FORMAT(9876543210, 2) AS formatted_number
    FROM CustomerData
) AS string_handling_results;

In [ ]:
#Subquery for Ranking
SELECT 
    customer_name, 
    (SELECT MAX(order_amount) 
     FROM Orders 
     WHERE order_amount < (SELECT MAX(order_amount) FROM Orders)) AS second_highest_order
FROM Customers;

In [ ]:
#views

In [3]:
%%sql
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    FirstName  VARCHAR(50),
    LastName   VARCHAR(50),
    Salary     DECIMAL(10,2),
    Department VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Salary, Department)
VALUES
    (1, 'Alice', 'Johnson', 55000.00, 'Sales'),
    (2, 'Bob',   'Smith',   60000.00, 'IT'),
    (3, 'Carol', 'Davis',   52000.00, 'Sales'),
    (4, 'Dave',  'Wilson',  58000.00, 'HR');

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[]

In [5]:
%%sql
CREATE VIEW SalesEmployees AS
SELECT EmployeeID, FirstName, LastName, Salary
FROM Employees
WHERE Department = 'Sales';

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
SELECT * FROM SalesEmployees;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'Alice', 'Johnson', Decimal('55000.00')),
 (3, 'Carol', 'Davis', Decimal('52000.00'))]

In [ ]:
#A view in SQL is essentially a virtual table that is defined by a SQL query. Unlike a regular table, a view does not store data physically. 
  #Instead, it dynamically retrieves data from one or more underlying tables (or even other views) whenever you query it.